introduction-rails-crud/app/controllers/items_controller.rb

INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asd"], ["price", "123"], ["created_at", "2022-03-30 05:49:00.153149"], ["updated_at", "2022-03-30 05:49:00.153149"]]
---
    def create
        item = Item.create(params.require(:item).permit(:name, :price))

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", "123x"], ["updated_at", "2022-03-30 05:50:58.300374"], ["id", 4]]
---
    def update
        @item = Item.find(params[:id])
        @item.update(params.require(:item).permit(:name, :price))